sub-routine/SY_3dHeatLoad/Automated/Sim_OutterField/Jet_rhosimple/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;

        //solver          PBiCGStab;
        //preconditioner  DILU;

        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        //solver          smoothSolver;
        //smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0.1;
    }
    rho
    {
        solver          diagonal;
        
    }
}

SIMPLE
{
    transoinc           yes;
    consistent          yes;

    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|e)"   1e-4;
    }

    nNonOrthogonalCorrectors 2;
    pMinFactor      0.1;
    pMaxFactor      2;

    //pMin            10000;
    //pMax            2000000;
}

relaxationFactors
{
    fields
    {
        //p               0.98;        //680step
        p               0.99;
        rho             0.7;
    }
    equations
    {
        //U               0.9;   //680step
        U               0.9931415926;//factor
        "(k|epsilon|h)"   0.7;
        e               0.7;
        //".*"            0.9;
    }
}


// ************************************************************************* //
